rocktan001/LiteOS/targets/STM32F769IDISCOVERY/include/platform_config.h
/* ----------------------------------------------------------------------------
 * Copyright (c) Huawei Technologies Co., Ltd. 2013-2019. All rights reserved.
 * Description: platform Config HeadFile
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice, this list of
 * conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice, this list
 * of conditions and the following disclaimer in the documentation and/or other materials
 * provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors may be used
 * to endorse or promote products derived from this software without specific prior written
 * permission.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --------------------------------------------------------------------------- */
/* ----------------------------------------------------------------------------
 * Notice of Export Control Law
 * ===============================================
 * Huawei LiteOS may be subject to applicable export control laws and regulations, which might
 * include those applicable to Huawei LiteOS of U.S. and the country in which you are located.
 * Import, export and usage of Huawei LiteOS in any manner by you shall be in compliance with such
 * applicable export control laws and regulations.
 * --------------------------------------------------------------------------- */

#ifndef _PLATFORM_CONFIG_H
#define _PLATFORM_CONFIG_H

#include "clock.h"
#include "stm32f7xx.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif /* __cplusplus */
#endif /* __cplusplus */

extern UINT32 __LOS_HEAP_ADDR_START__;
extern UINT32 __LOS_HEAP_ADDR_END__;
#define OS_SYS_MEM_SIZE        ((UINT32)(__LOS_HEAP_ADDR_END__ - __LOS_HEAP_ADDR_START__ + 1))

#define LOSCFG_BASE_CORE_TSK_CONFIG                15
#define LOSCFG_BASE_CORE_TSK_LIMIT                 16
#define LOSCFG_BASE_CORE_TICK_PER_SECOND           1000
#define LOSCFG_BASE_CORE_SWTMR_CONFIG              16
#define LOSCFG_BASE_IPC_QUEUE_CONFIG               10
#define LOSCFG_BASE_IPC_MUX_CONFIG                 20
#define LOSCFG_BASE_IPC_SEM_CONFIG                 20
#define LOS_TASK_MIN_STACK_SIZE                    0x200
#define LOSCFG_BASE_CORE_TSK_DEFAULT_STACK_SIZE    0x600
#define LOSCFG_BASE_CORE_EXC_TSK_SWITCH            YES
#define LOSCFG_COMPAT_CMSIS_FW                     YES
#define LOSCFG_PLATFORM_EXC                        YES
#define LOSCFG_NO_SHARED_IRQ
#define LOSCFG_GUI_ENABLE
#define LOSCFG_CMSIS_VERSION                       1

#ifdef __cplusplus
#if __cplusplus
}
#endif /* __cplusplus */
#endif /* __cplusplus */

#endif /* _PLATFORM_CONFIG_H */